Terraform plan for __production__
<details>
  <summary>Plan: 4 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["invoice"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "invoice"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "1Gi"
                }
              + default_request = {
                  + "cpu"    = "500m"
                  + "memory" = "800Mi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_namespace.gke_namespace["invoice"] will be created
  + resource "kubernetes_namespace" "gke_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "invoice"
            }
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
              + "project"         = "ebo-prod"
            }
          + name             = "invoice"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_string.random_password_create will be created
  + resource "random_string" "random_password_create" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.pubsub.google_pubsub_topic.topic[0] must be replaced
-/+ resource "google_pubsub_topic" "topic" {
      ~ id      = "******************************************" -> (known after apply)
      - labels  = {} -> null
      ~ name    = "topic_sample_name" -> "inventory-threshold-create" # forces replacement
        # (1 unchanged attribute hidden)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #229](https://github.com/ebomart/commerce-infrastructure/actions/runs/1308047247)